<!-- dflook/terraform-github-actions {"workspace":"dev","backend_type":"s3","label":"dev","backend":"74a95c7bf7f1889c91733ff0410811659467e9212178032ecf0cb0b5a0d6880c","plan_job_ref":"Job CICD for Splitrr Infra #11 at https://github.com/bibek65/Splitrr-Infrastructure/actions/runs/10654790458","plan_out_hash":"a2cf42c2a9a2b1e24cc3edcaa0002858042a878237c867d4fd3ac2f4b56ad8a0","plan_hash":"637c3e344f5d752f66ce63eb271193af05ad42d8ae5322fc3f45303a532e3d3e","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan for __dev__
<details>
<summary>Plan: 8 to add, 0 to change, 4 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-   destroy

Terraform will perform the following actions:

  # module.alb.aws_alb.golend_alb will be created
+   resource "aws_alb" "golend_alb" {
+       arn                                                          = (known after apply)
+       arn_suffix                                                   = (known after apply)
+       client_keep_alive                                            = 3600
+       desync_mitigation_mode                                       = "defensive"
+       dns_name                                                     = (known after apply)
+       drop_invalid_header_fields                                   = false
+       enable_deletion_protection                                   = false
+       enable_http2                                                 = true
+       enable_tls_version_and_cipher_suite_headers                  = false
+       enable_waf_fail_open                                         = false
+       enable_xff_client_port                                       = false
+       enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
+       id                                                           = (known after apply)
+       idle_timeout                                                 = 60
+       internal                                                     = false
+       ip_address_type                                              = (known after apply)
+       load_balancer_type                                           = "application"
+       name                                                         = "splitrr-dev-alb"
+       name_prefix                                                  = (known after apply)
+       preserve_host_header                                         = false
+       security_groups                                              = (known after apply)
+       subnets                                                      = [
+           "subnet-00cd8d95d55e658ac",
+           "subnet-05af162f25139917c",
        ]
+       tags                                                         = {
+           "Name" = "splitrr-dev-alb"
        }
+       tags_all                                                     = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "splitrr-dev-alb"
+           "Project" = "Splitrr"
        }
+       vpc_id                                                       = (known after apply)
+       xff_header_processing_mode                                   = "append"
+       zone_id                                                      = (known after apply)

+       subnet_mapping (known after apply)
    }

  # module.alb.aws_alb_listener.backend_end will be created
+   resource "aws_alb_listener" "backend_end" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       load_balancer_arn = (known after apply)
+       port              = 80
+       protocol          = "HTTP"
+       ssl_policy        = (known after apply)
+       tags              = {
+           "Name" = "splitrr-dev-alb-listener"
        }
+       tags_all          = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "splitrr-dev-alb-listener"
+           "Project" = "Splitrr"
        }

+       default_action {
+           order = (known after apply)
+           type  = "redirect"

+           redirect {
+               host        = "#{host}"
+               path        = "/#{path}"
+               port        = "443"
+               protocol    = "HTTPS"
+               query       = "#{query}"
+               status_code = "HTTP_301"
            }
        }

+       mutual_authentication (known after apply)
    }

  # module.alb.aws_alb_listener.https_listener will be created
+   resource "aws_alb_listener" "https_listener" {
+       arn               = (known after apply)
+       certificate_arn   = "arn:aws:acm:us-east-1:949263681218:certificate/6016b782-65a8-4829-8015-6e37b0b3701d"
+       id                = (known after apply)
+       load_balancer_arn = (known after apply)
+       port              = 443
+       protocol          = "HTTPS"
+       ssl_policy        = "ELBSecurityPolicy-TLS13-1-2-2021-06"
+       tags              = {
+           "Name" = "splitrr-dev-alb-https-listener"
        }
+       tags_all          = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "splitrr-dev-alb-https-listener"
+           "Project" = "Splitrr"
        }

+       default_action {
+           order = (known after apply)
+           type  = "fixed-response"

+           fixed_response {
+               content_type = "text/plain"
+               message_body = "Not Found"
+               status_code  = "404"
            }
        }

+       mutual_authentication (known after apply)
    }

  # module.alb.aws_security_group.lb will be created
+   resource "aws_security_group" "lb" {
+       arn                    = (known after apply)
+       description            = "controls access to the ALB"
+       egress                 = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "-1"
+               security_groups  = []
+               self             = false
+               to_port          = 0
#                (1 unchanged attribute hidden)
            },
        ]
+       id                     = (known after apply)
+       ingress                = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               from_port        = 443
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 443
#                (1 unchanged attribute hidden)
            },
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               from_port        = 80
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 80
#                (1 unchanged attribute hidden)
            },
        ]
+       name                   = "splitrr-dev-alb-lb-sg"
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Name" = "splitrr-dev-alb-lb-sg"
        }
+       tags_all               = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "splitrr-dev-alb-lb-sg"
+           "Project" = "Splitrr"
        }
+       vpc_id                 = "*********************"
    }

  # module.app_route53_record.aws_route53_record.site_domain will be created
+   resource "aws_route53_record" "site_domain" {
+       allow_overwrite = (known after apply)
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = "app"
+       type            = "A"
+       zone_id         = "*********************"

+       alias {
+           evaluate_target_health = true
+           name                   = (known after apply)
+           zone_id                = (known after apply)
        }
    }

  # module.backend_route53_record.aws_route53_record.site_domain will be created
+   resource "aws_route53_record" "site_domain" {
+       allow_overwrite = (known after apply)
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = "api"
+       type            = "A"
+       zone_id         = "*********************"

+       alias {
+           evaluate_target_health = true
+           name                   = (known after apply)
+           zone_id                = (known after apply)
        }
    }

  # module.secrets.aws_secretsmanager_secret.secret will be created
+   resource "aws_secretsmanager_secret" "secret" {
+       arn                            = (known after apply)
+       description                    = "Secret for environment variables"
+       force_overwrite_replica_secret = false
+       id                             = (known after apply)
+       name                           = "splitrr-dev-secret-manager"
+       name_prefix                    = (known after apply)
+       policy                         = (known after apply)
+       recovery_window_in_days        = 30
+       tags                           = {
+           "Name" = "splitrr-dev-secret-manager"
        }
+       tags_all                       = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "splitrr-dev-secret-manager"
+           "Project" = "Splitrr"
        }
#        (1 unchanged attribute hidden)

+       replica (known after apply)
    }

  # module.secrets.aws_secretsmanager_secret_version.secret_version will be created
+   resource "aws_secretsmanager_secret_version" "secret_version" {
+       arn            = (known after apply)
+       id             = (known after apply)
+       secret_id      = (known after apply)
+       secret_string  = (sensitive value)
+       version_id     = (known after apply)
+       version_stages = (known after apply)
    }

  # module.vpc.aws_iam_role.vpc_flow_role[0] will be destroyed
  # (because index [0] is out of range for count)
-   resource "aws_iam_role" "vpc_flow_role" {
-       arn                   = "arn:aws:iam::949263681218:role/splitrr-dev-vpc-flow-role" -> null
-       assume_role_policy    = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = "sts:AssumeRole"
-                       Effect    = "Allow"
-                       Principal = {
-                           Service = "vpc-flow-logs.amazonaws.com"
                        }
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> null
-       create_date           = "2024-09-01T14:16:46Z" -> null
-       force_detach_policies = false -> null
-       id                    = "splitrr-dev-vpc-flow-role" -> null
-       managed_policy_arns   = [] -> null
-       max_session_duration  = 3600 -> null
-       name                  = "splitrr-dev-vpc-flow-role" -> null
-       path                  = "/" -> null
-       tags_all              = {
-           "Creator" = "bibeklabh@lftechnology.com"
-           "Project" = "Splitrr"
        } -> null
-       unique_id             = "AROA52BEGI3BBHFHIPJMQ" -> null
#        (3 unchanged attributes hidden)
    }

  # module.vpc.aws_iam_role_policy.vpc_flow_role_policy[0] will be destroyed
  # (because index [0] is out of range for count)
-   resource "aws_iam_role_policy" "vpc_flow_role_policy" {
-       id          = "splitrr-dev-vpc-flow-role:splitrr-dev-vpc-flow-role-policy" -> null
-       name        = "splitrr-dev-vpc-flow-role-policy" -> null
-       policy      = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = [
-                           "logs:PutLogEvents",
-                           "logs:DescribeLogStreams",
-                           "logs:DescribeLogGroups",
-                           "logs:CreateLogStream",
-                           "logs:CreateLogGroup",
                        ]
-                       Effect   = "Allow"
-                       Resource = "*"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> null
-       role        = "splitrr-dev-vpc-flow-role" -> null
#        (1 unchanged attribute hidden)
    }

  # module.vpc.aws_kms_alias.cloudwatch_log_key_alias[0] will be destroyed
  # (because index [0] is out of range for count)
-   resource "aws_kms_alias" "cloudwatch_log_key_alias" {
-       arn            = "arn:aws:kms:us-east-1:949263681218:alias/splitrr-dev-vpc-cloudwatch-key" -> null
-       id             = "alias/splitrr-dev-vpc-cloudwatch-key" -> null
-       name           = "alias/splitrr-dev-vpc-cloudwatch-key" -> null
-       target_key_arn = "arn:aws:kms:us-east-1:949263681218:key/2b3ccb3c-3b14-4a51-9814-0c3cb0a4f862" -> null
-       target_key_id  = "2b3ccb3c-3b14-4a51-9814-0c3cb0a4f862" -> null
#        (1 unchanged attribute hidden)
    }

  # module.vpc.aws_kms_key.cloudwatch_log_key[0] will be destroyed
  # (because index [0] is out of range for count)
-   resource "aws_kms_key" "cloudwatch_log_key" {
-       arn                                = "arn:aws:kms:us-east-1:949263681218:key/2b3ccb3c-3b14-4a51-9814-0c3cb0a4f862" -> null
-       bypass_policy_lockout_safety_check = false -> null
-       customer_master_key_spec           = "SYMMETRIC_DEFAULT" -> null
-       description                        = "KMS key for encrypting CloudWatch Logs" -> null
-       enable_key_rotation                = false -> null
-       id                                 = "2b3ccb3c-3b14-4a51-9814-0c3cb0a4f862" -> null
-       is_enabled                         = true -> null
-       key_id                             = "2b3ccb3c-3b14-4a51-9814-0c3cb0a4f862" -> null
-       key_usage                          = "ENCRYPT_DECRYPT" -> null
-       multi_region                       = false -> null
-       policy                             = jsonencode(
            {
-               Id        = "key-default-1"
-               Statement = [
-                   {
-                       Action    = "kms:*"
-                       Effect    = "Allow"
-                       Principal = {
-                           AWS = "arn:aws:iam::949263681218:root"
                        }
-                       Resource  = "*"
-                       Sid       = "Enable IAM User Permissions"
                    },
-                   {
-                       Action    = [
-                           "kms:Encrypt",
-                           "kms:Decrypt",
-                           "kms:ReEncrypt*",
-                           "kms:GenerateDataKey*",
-                           "kms:DescribeKey",
                        ]
-                       Effect    = "Allow"
-                       Principal = {
-                           Service = "logs.ap-southeast-2.amazonaws.com"
                        }
-                       Resource  = "*"
-                       Sid       = "Allow CloudWatch Logs use of the key"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> null
-       rotation_period_in_days            = 0 -> null
-       tags                               = {
-           "Name" = "splitrr-dev-vpc-cloudwatch-log-key"
        } -> null
-       tags_all                           = {
-           "Creator" = "bibeklabh@lftechnology.com"
-           "Name"    = "splitrr-dev-vpc-cloudwatch-log-key"
-           "Project" = "Splitrr"
        } -> null
#        (2 unchanged attributes hidden)
    }

Plan: 8 to add, 0 to change, 4 to destroy.
```
</details>

:memo: Plan generated in [CICD for Splitrr Infra #11](https://github.com/bibek65/Splitrr-Infrastructure/actions/runs/10654790458)